import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Святогорская лавра',
    lat: 49.0281534,
    lng: 37.5653275,
    url: 'https://etnosvit.com/wp-content/uploads/2019/03/Svyatogorskaya-lavra.jpg',
    details: 'Свято-Успенская Святогорская лавра является значительным духовным центром православной паствы всего востока современной Украины',
    type: 'монастырь'
  ),
  Sight(
    name: 'Соленое озеро Вейсовое',
    lat: 48.8685977,
    lng: 37.6258993,
    url: 'https://v-variant.com.ua/uploads/posts/2020-06/1591623783_102301981_139771491044028_7830165588986036224_o.jpg',
    details: 'Пляж после реконструкции стал прекрасный. Отличное место для отдыха. Подходит и семьям с детками и людям пожилого возраста.',
    type: 'озеро'
  ),
  Sight(
    name: 'Карачун',
    lat: 48.8685977,
    lng: 37.6258993,
    url: 'https://i.imgur.com/LhaD237.jpg',
    details: 'Название горы переводится с тюркского как «чёрная смерть». Это название, предположительно, связано с тем, что из-за своего господствующего положения гора помогала первым поселенцам защищаться от набегов половцев. Позднее на горе располагались казацкие дозоры',
    type: 'гора'
  )
];